In [1]:
import numpy as np
import pandas as pd

missing values

In [2]:
d={'a':[1,2,np.nan],'b':[5,np.nan,np.nan],'c':[1,2,3]}

In [3]:
df = pd.DataFrame(d)

In [4]:
df

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
df.dropna()

     a    b  c
0  1.0  5.0  1

In [6]:
df.dropna(axis = 1)

   c
0  1
1  2
2  3

In [7]:
df.dropna(thresh=2)

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2

In [8]:
df.dropna(thresh=1)

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [9]:
df

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [10]:
df.fillna(value = 'FILL VALUE')

            a           b  c
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [11]:
df['a'].fillna(value=df['a'].mean())

0    1.0
1    2.0
2    1.5
Name: a, dtype: float64

In [12]:
df.fillna(value=df.mean())

     a    b  c
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [13]:
data = {'company' :['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'PERSON':['Sam','charlie','amy','vanesa','carl','sarah'],
        'sales':[200,120,340,124,243,350]}

In [14]:
df = pd.DataFrame(data)

In [15]:
df

  company   PERSON  sales
0    GOOG      Sam    200
1    GOOG  charlie    120
2    MSFT      amy    340
3    MSFT   vanesa    124
4      FB     carl    243
5      FB    sarah    350

In [16]:
bycom = df.groupby('company')

In [17]:
bycom.mean()

         sales
company
FB       296.5
GOOG     160.0
MSFT     232.0

In [18]:
bycom.sum()

         sales
company
FB         593
GOOG       320
MSFT       464

In [19]:
bycom.std()

              sales
company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [20]:
bycom.sum().loc['FB']

sales    593
Name: FB, dtype: int64

In [21]:
df.groupby('company').sum().loc['FB']

sales    593
Name: FB, dtype: int64

In [22]:
bycom.count()

         PERSON  sales
company
FB            2      2
GOOG          2      2
MSFT          2      2

In [23]:
df.groupby('company').max()

          PERSON  sales
company
FB         sarah    350
GOOG     charlie    200
MSFT      vanesa    340

In [24]:
bycom.min().loc['FB']

PERSON    carl
sales      243
Name: FB, dtype: object

In [25]:
df.groupby('company').describe().transpose()

company              FB        GOOG        MSFT
sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

OPERATIONS

In [26]:
df = pd.DataFrame({'col1':[1,2,3,4],
                  'col2':[444,555,666,444]
                  ,'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [27]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [28]:
df['col1'].nunique()

4

In [29]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [30]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [31]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [32]:
booldf = df['col1']>2

In [33]:
booldf

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [34]:
df[(df['col1']>2)&(df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [35]:
def times2(x):
    return x*2

In [36]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [37]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [38]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [39]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [40]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [45]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [46]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [50]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
       'B':['one','one','two','two','one','one'],
        'C':['x','y','x','y','x','y'],
        'D':[1,3,3,5,4,1]}

In [51]:
df = pd.DataFrame(data)

In [52]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  3
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [57]:
df.pivot_table(values='D',index=['A','B'],columns= ['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  3.0  NaN